// Comment line - ignored.

// The ${ignore} macro accepts any single word element.

S: 220 ${ignore} SMTP Server (JAMES SMTP Server 2.0a2) ready ${rfcDate}
C: HELO localhost
S: 250 ${ignore} Hello localhost (127.0.0.1 [127.0.0.1])
// The ${from-address} and ${to-address} macros are NYI, but you get the idea.
C: MAIL FROM: <${from-address}>
S: 250 Sender <${from-address}> OK
C: RCPT TO: <${to-address}>
S: 250 Recipient <${to-address}> OK
C: DATA
S: 354 Ok Send data ending with <CRLF>.<CRLF>
C: test
C: .
S: 250 Message received
C: QUIT
S: 221 ${ignore} Service closing transmission channel
